SmartArm/SmartArm/STM32决赛代码/main.c
//#include"arm.h"
#include"pwm.h"
#include"wifi.h"
#include<stdio.h>
#include<stdlib.h>
#include<stm32f4xx_it.h>
#include<math.h>
#include"SysTick.h"
#define PI 3.1415926535897932384626433 
#define dataNum 15
//#define l1 100 //大臂长度mm
//#define l2 95 //小臂长度mm
char USART1_RECV_BUF[300];
int ready=0;
int length=0;

////////////////////////////////////////////////
#define L1 10//150
#define L2 100//614
#define L3 10//155
#define L4 -100//-640
#define L6 0//0

//double ino[7];输入的角度值
double nx, ny, nz, ox, oy, oz, ax, ay, az, px, py, pz;//转换矩阵的值
double outo[9][7];//输出角度值
int pointnum;//记录是第几行的数据
int DrawFlag[2];//判断是否要显示外维空间和内维空间的数据
int ranum[9];//记录正确数据组的个数
int flagg[9];//传递标志位值

double m_ax = 0.0;
double m_ay = 0.0;
double m_az = 0.0;
double m_nx = 0.0;
double m_ny = 0.0;
double m_nz = 0.0;
double m_ino1 = 0.0;
double m_ino2 = 0.0;
double m_ino3 = 0.0;
double m_ino4 = 0.0;
double m_ino5 = 0.0;
double m_ino6 = 0.0;
double m_ox = 0.0;
double m_oy = 0.0;
double m_oz = 0.0;
double m_px = 0.0;
double m_py = 0.0;
double m_pz = 0.0;
double m_OutO11 = 10.01;
double m_OutO12 = 10.01;
double m_OutO13 = 10.01;
double m_OutO14 = 10.01;
double m_OutO15 = 10.01;
double m_OutO16 = 10.01;
double rmax = 40000;//半径最大值
double rmin = 3025;//半径最小值
double r;//确定位置的长度
void RunNijie(void);
void LinePos(void);
int calcAngle(void);//计算舵机角度
int DetAngScal(double aa, double bb, double cc, double dd, double ee);
///////////////////////////////////////////////

int *GetIntData();
void updateData(int *data);//用以更新控制数据的函数

extern void Delay_ms(__IO uint32_t nTime);//延时us函数
void ManualControl(void);

struct servo{
  int lastPos;
  int label;
}servos[6]={
  {12,1},{0,2},{0,3},{60,4},{0,5},{0,6}
};
struct Spherical_coor{
  float r;
  int phi;
  int theta;
}S_Coordinate={195,180,0};

struct servo* servo_ptr=&servos[0];  
int theta1=0,theta2=0,theta3=0;//theta1是底座舵机角度,theta2是大臂舵机角度,theta3是小臂舵机角度
int armStatus=1;//手臂状态记录，0代表处于复位状态，1代表正常动作状态

void runServoToByStep(struct servo* s_ptr,int target,int step,int interval);
void runServoTo(struct servo* s_ptr,int target);
void armInit(void);
void armReset(void);
#define radius 50;//用于画圆函数的半径
void DrawCircle(int cx,int cy,int cz);//机械臂在当前水平面上画圆  
void up_and_down(void);//机械臂点头
int gotHand=0,x=0,y=0,z=0,pitch=90,roll=90,yaw=0,pinch=100, circleGesture=0,tapGesture=0,speed=0,
    normalPause=0,autoTrack=0,camX=0,camY=0;//gotHand代表当前用户的手是否在识别区里
 uint32_t TimeNow=0,LastTime=0;//分别用以记录现在的时间和上一次进行PID计算的时间，单位为ms
 /*********************************以下是自动追踪PID算法的函数************************************************/
typedef struct PID
{
  int SetPoint; //设定目标 Desired Value
  long SumError; //误差累计
  double Proportion;//比例常数 Proportional Const
  double Integral; //积分常数 Integral Const
  double Derivative; //微分常数 Derivative Const
  int LastError; //Error[-1]
  int PrevError; //Error[-2]
};
static struct PID xPID={0,0,0,0,0,0,0},yPID={0,0,0,0,0,0,0};//初始化两个PID结构体
static struct PID *Xptr = &xPID;
static struct PID *Yptr = &yPID;

//增量式PID控制设计
int IncPIDCalc(int NextPoint,struct PID * ptr)
{
  register int iError, iIncpid;
  //当前误差
  iError = ptr->SetPoint - NextPoint;
  //增量计算
  iIncpid = ptr->Proportion * iError //E[k]项
          - ptr->Integral * ptr->LastError //E[k－1]项
          + ptr->Derivative * ptr->PrevError; //E[k－2]项
  //存储误差，用于下次计算
  ptr->PrevError = ptr->LastError;
  ptr->LastError = iError;
  //返回增量值
  return iIncpid;
}
/************************设置比例参数*************************/
void SetProportion(struct PID * ptr,double p)
{
  ptr->Proportion=p;
}
/************************设置微分参数*************************/
void SetDerivative(struct PID * ptr,double d)
{
  ptr->Derivative=d;
}
/************************设置目标*************************/
void SetTarget(struct PID * ptr,double target)
{
  ptr->SetPoint=target;
}
/*********************************PID算法的函数代码段结束************************************************/
int main(void)
{
       NVIC_Config();
       USART1_Config();
       TIM3_PWM_Init();
       TIM2_PWM_Init();
       TIM1_GPIO_Config();
       Tim1_Config();
      
       //TIM_SetCompare1 (TIM1,10000);
       //初始化串口1，中断方式接收
       SysTick_Init();//初始化时钟
       SysTick->CTRL |=  SysTick_CTRL_ENABLE_Msk;//使能时钟

      
     

      
       armInit();//初始化机械臂

       //uint32_t Time1=0,Time2=0;
       
       

        while(1){
         
         servo_ptr=&servos[0];

         if(ready==1){
           USART_ITConfig(USART1,USART_IT_RXNE,DISABLE);//暂时关闭接收中断
           int *dataBuf;
           updateData(dataBuf);
         
           if(autoTrack)//自动追踪
           {
             TimeNow=getTime();
             if(TimeNow-LastTime>=50)//每50MS进行一次PID计算
             {
            /*  SetTarget(Xptr,camX);//设置X坐标目标
              SetTarget(Yptr,camY);//设置Y坐标目标
              int xInc=0,yInc=0;
              xInc=IncPIDCalc(x,Xptr);
              yInc=IncPIDCalc(y,Yptr);//计算增量
              x+=xInc;
              y+=yInc;//更新输出
              //以下是执行代码
              S_Coordinate=change_coordinate(x,y,z);
              setTheta(x,y,z);
              runServoTo(servo_ptr,roll);
              pitch=pitch+theta2;//结合小臂舵机的角度调整俯仰角，使得尽量平行水平面
              if(pitch>90) pitch=90;
              if(pitch<-90) pitch=-90;
              runServoTo(servo_ptr+1,pitch);
              
              runServoTo(servo_ptr+3,60);//张爪子
              
              if(S_Coordinate.r>100)
              {
                 runServoTo(servo_ptr+2, -S_Coordinate.phi);//底座舵机         
              }
              else
              {
                //runServoTo(servo_ptr+2,yaw);//底座舵机      
                
              }
              if(theta2>90) theta2=90;
              else if(theta2<-90) theta2=-90;
              if(theta1>90) theta1=90;
              else if(theta1<-90) theta1=-90;

              runServoTo(servo_ptr+4,theta1);//大臂舵机
              runServoTo(servo_ptr+5,theta2);//小臂舵机  */
              ready=0;
              length=0;
              free(dataBuf);
              USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);//打开接收中断                
             }
             else
             {//计算时间未到，保持原状态
               ready=0;
               length=0;
                free(dataBuf);
               USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);//打开接收中断     
             }
           }
           else 
           {
             ManualControl();
             //手动控制的代码
             ready=0;
             length=0;    
             free(dataBuf);
             USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);//打开接收中断
           }
           
             ready=0;
             length=0;    
             free(dataBuf);
             USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);//打开接收中断
         
