SmartArm/SmartArm/STM32决赛代码/main.c
        }
         
        
      
   }
}

/*该函数将缓冲区内的数据转化为int类型，然后将int数组的指针返回*/
int *GetIntData()
{
 
  
  int beginPos[dataNum],endPos[dataNum];//记录每个数据的开始和结束的位置
  beginPos[0]=0;
  int num=0;
  for(int x=0;x<length;x++)
  {
    if(USART1_RECV_BUF[x]==' '||USART1_RECV_BUF[x]=='\0')
    {
      endPos[num]=x-1;
      
      num++;
      if(num==dataNum ) break;//有dataNum个数据
      beginPos[num]=x+1;
    
    }
  }
  num=0;
  char temp[10];//临时存放分割好的字符串
  int *Data=(int*)calloc(dataNum,sizeof(int));//用于存储转化后的数据
  for(int x=0;x<dataNum;x++)
  {

    for(int y=beginPos[x];y<=endPos[x];y++)
    {
      if((USART1_RECV_BUF[y]<48&&USART1_RECV_BUF[y]!=45)||USART1_RECV_BUF[y]>57) continue;//跳过非法字符
      temp[num]=USART1_RECV_BUF[y];
      num++;
      if(y==endPos[x])
      {
        temp[num]='\0';// 最后一位结束符
        num=0;
      }
    }
    (*(Data+x))=atoi(temp); //转化为整数
    
 
  }
  return Data;

}
/*************************更新控制数据,并进行初步处理**************************/
void updateData(int *data){
  
  data=GetIntData();

  gotHand=*(data);
  x=*(data+1);
  y=*(data+2);
  z=*(data+3);
    
  //y=y-50;//将坐标系沿Y轴平移，方便控制
  //z=z-100;//将坐标系沿Z轴平移，方便控制
  if(z>0) z=0;//限制边界
  pitch=*(data+4);
  roll=*(data+5);
  roll=roll+12;//修正偏差
  yaw=*(data+6);
  pinch=*(data+7);
  circleGesture=*(data+8);
  tapGesture=*(data+9);
  speed=*(data+10);//用户手的移动速度
  normalPause=*(data+11);//是否进入暂停控制状态
  autoTrack=*(data+12);//是否进入自动追踪状态
  camX=*(data+13);//追踪对象的X坐标
  camY=*(data+14);//追踪对象的Y坐标
}
/*****************根据收到的直角坐标系进行逆解求解得出各个舵机的角度***********/
void RunNijie()//求逆解
{
  double s1[3], s2[5], s3[5], s4[9], s5[9], c1[3], c2[5], c3[5], c4[9], c5[9], s23[5], c23[5];//这里的s23为sin(o2-o3),c23为cos(o2-o3)
  double u[3], v, a[3], h[5], w[3];//中间变量，省的写很长的式子

  //算o1,有两个解
  outo[1][1] = atan2(ay*L6 + py, ax*L6 + px);
  c1[1] = cos(outo[1][1]);
  s1[1] = sin(outo[1][1]);

  outo[3][1] = outo[1][1];
  outo[5][1] = outo[1][1];
  outo[7][1] = outo[1][1];

  outo[2][1] = atan2(-ay*L6 - py, -ax*L6 - px);
  c1[2] = cos(outo[2][1]);
  s1[2] = sin(outo[2][1]);

  outo[4][1] = outo[2][1];
  outo[6][1] = outo[2][1];
  outo[8][1] = outo[2][1];

  //算o2，由于o1有两个解，o2有四个解,
  u[1] = c1[1] * (ax*L6 + px) + s1[1] * (ay*L6 + py) - L1;
  v = az*L6 + pz;
  a[1] = (L3*L3 + L4*L4 - L2*L2 - u[1] * u[1] - v*v) / (2 * L2);

  u[2] = c1[2] * (ax*L6 + px) + s1[2] * (ay*L6 + py) - L1;
  a[2] = (L3*L3 + L4*L4 - L2*L2 - u[2] * u[2] - v*v) / (2 * L2);

  w[1] = u[1] * u[1] + v*v - a[1] * a[1];
  w[2] = u[2] * u[2] + v*v - a[2] * a[2];

  outo[1][2] = atan2(a[1] * v - u[1] * sqrt(w[1]), -1 * a[1] * u[1] - v*sqrt(w[1]));
  c2[1] = cos(outo[1][2]);
  s2[1] = sin(outo[1][2]);

  //  if ( (-1*a[2]*u[2]-v*sqrt(u[2]*u[2]+v*v-a[2]*a[2]) )!=0 )
  //  {
  //  }

  outo[2][2] = atan2(a[2] * v - u[2] * sqrt(w[2]), -1 * a[2] * u[2] - v*sqrt(w[2]));
  c2[2] = cos(outo[2][2]);
  s2[2] = sin(outo[2][2]);


  outo[3][2] = atan2(a[1] * v + u[1] * sqrt(w[1]), -1 * a[1] * u[1] + v*sqrt(w[1]));
  c2[3] = cos(outo[3][2]);
  s2[3] = sin(outo[3][2]);

  //  if ( (-1*a[2]*u[2]+v*sqrt(u[2]*u[2]+v*v-a[2]*a[2]) )!=0 )
  //  {
  //  }
  outo[4][2] = atan2(a[2] * v + u[2] * sqrt(w[2]), -1 * a[2] * u[2] + v*sqrt(w[2]));
  c2[4] = cos(outo[4][2]);
  s2[4] = sin(outo[4][2]);

  outo[5][2] = outo[1][2];
  outo[6][2] = outo[2][2];
  outo[7][2] = outo[3][2];
  outo[8][2] = outo[4][2];


  //算o3,完全取决于o2，所以有四种情况。
  outo[1][3] = atan2((s2[1] * u[1] + c2[1] * v)*L3 + (L2 + s2[1] * v - c2[1] * u[1])*L4, (s2[1] * u[1] + c2[1] * v)*L4 - (L2 + s2[1] * v - c2[1] * u[1])*L3);
  s3[1] = sin(outo[1][3]);
  c3[1] = cos(outo[1][3]);

  outo[2][3] = atan2((s2[2] * u[2] + c2[2] * v)*L3 + (L2 + s2[2] * v - c2[2] * u[2])*L4, (s2[2] * u[2] + c2[2] * v)*L4 - (L2 + s2[2] * v - c2[2] * u[2])*L3);
  s3[2] = sin(outo[2][3]);
  c3[2] = cos(outo[2][3]);

  outo[3][3] = atan2((s2[3] * u[1] + c2[3] * v)*L3 + (L2 + s2[3] * v - c2[3] * u[1])*L4, (s2[3] * u[1] + c2[3] * v)*L4 - (L2 + s2[3] * v - c2[3] * u[1])*L3);
  s3[3] = sin(outo[3][3]);
  c3[3] = cos(outo[3][3]);

  //  if ( ((s2[4]*u[2]+c2[4]*v)*L4 - (L2+s2[4]*v-c2[4]*u[2])*L3)!=0 )
  //  {
  //  }
  outo[4][3] = atan2((s2[4] * u[2] + c2[4] * v)*L3 + (L2 + s2[4] * v - c2[4] * u[2])*L4, (s2[4] * u[2] + c2[4] * v)*L4 - (L2 + s2[4] * v - c2[4] * u[2])*L3);
  s3[4] = sin(outo[4][3]);
  c3[4] = cos(outo[4][3]);

  outo[5][3] = outo[1][3];
  outo[6][3] = outo[2][3];
  outo[7][3] = outo[3][3];
  outo[8][3] = outo[4][3];



  //算o5,八个解，取决于o1o2o3.
  s23[1] = s2[1] * c3[1] - c2[1] * s3[1];
  s23[2] = s2[2] * c3[2] - c2[2] * s3[2];
  s23[3] = s2[3] * c3[3] - c2[3] * s3[3];
  s23[4] = s2[4] * c3[4] - c2[4] * s3[4];

  c23[1] = c2[1] * c3[1] + s2[1] * s3[1];
  c23[2] = c2[2] * c3[2] + s2[2] * s3[2];
  c23[3] = c2[3] * c3[3] + s2[3] * s3[3];
  c23[4] = c2[4] * c3[4] + s2[4] * s3[4];


  h[1] = -1 * s23[1] * (ax*c1[1] + ay*s1[1]) - az*c23[1];
  h[2] = -1 * s23[2] * (ax*c1[2] + ay*s1[2]) - az*c23[2];
  h[3] = -1 * s23[3] * (ax*c1[1] + ay*s1[1]) - az*c23[3];
  h[4] = -1 * s23[4] * (ax*c1[2] + ay*s1[2]) - az*c23[4];


  outo[1][5] = atan2(sqrt(1 - h[1] * h[1]), h[1]);
  s5[1] = sin(outo[1][5]);
  c5[1] = cos(outo[1][5]);

  outo[2][5] = atan2(sqrt(1 - h[2] * h[2]), h[2]);
  s5[2] = sin(outo[2][5]);
  c5[2] = cos(outo[2][5]);

  outo[3][5] = atan2(sqrt(1 - h[3] * h[3]), h[3]);
  s5[3] = sin(outo[3][5]);
  c5[3] = cos(outo[3][5]);

  outo[4][5] = atan2(sqrt(1 - h[4] * h[4]), h[4]);
  s5[4] = sin(outo[4][5]);
  c5[4] = cos(outo[4][5]);

  outo[5][5] = atan2(-sqrt(1 - h[1] * h[1]), h[1]);
  s5[5] = sin(outo[5][5]);
  c5[5] = cos(outo[5][5]);

  outo[6][5] = atan2(-sqrt(1 - h[2] * h[2]), h[2]);
  s5[6] = sin(outo[6][5]);
  c5[6] = cos(outo[6][5]);

  outo[7][5] = atan2(-sqrt(1 - h[3] * h[3]), h[3]);
  s5[7] = sin(outo[7][5]);
  c5[7] = cos(outo[7][5]);

  outo[8][5] = atan2(-sqrt(1 - h[4] * h[4]), h[4]);
  s5[8] = sin(outo[8][5]);
  c5[8] = cos(outo[8][5]);

  //算o4
  //  if (((c23[1]*(ax*c1[1]+ay*s1[1])-az*s23[1])/s5[1])!=0&&s5[1]!=0)
  //  {
  //  }
  outo[1][4] = atan2(-(ax*s1[1] - ay*c1[1]) / s5[1], (c23[1] * (ax*c1[1] + ay*s1[1]) - az*s23[1]) / s5[1]);
  s4[1] = sin(outo[1][4]);
  c4[1] = cos(outo[1][4]);

  outo[2][4] = atan2(-(ax*s1[2] - ay*c1[2]) / s5[2], (c23[2] * (ax*c1[2] + ay*s1[2]) - az*s23[2]) / s5[2]);
  s4[2] = sin(outo[2][4]);
  c4[2] = cos(outo[2][4]);

