SmartArm/SmartArm/STM32决赛代码/main.c
  outo[3][4] = atan2(-(ax*s1[1] - ay*c1[1]) / s5[3], (c23[3] * (ax*c1[1] + ay*s1[1]) - az*s23[3]) / s5[3]);
  s4[3] = sin(outo[3][4]);
  c4[3] = cos(outo[3][4]);

  outo[4][4] = atan2(-(ax*s1[2] - ay*c1[2]) / s5[4], (c23[4] * (ax*c1[2] + ay*s1[2]) - az*s23[4]) / s5[4]);
  s4[4] = sin(outo[4][4]);
  c4[4] = cos(outo[4][4]);

  //  if (((c23[1]*(ax*c1[1]+ay*s1[1])-az*s23[1])/s5[5])!=0&&s5[1]!=0)
  //  {
  //  }
  outo[5][4] = atan2(-(ax*s1[1] - ay*c1[1]) / s5[5], (c23[1] * (ax*c1[1] + ay*s1[1]) - az*s23[1]) / s5[5]);
  s4[5] = sin(outo[5][4]);
  c4[5] = cos(outo[5][4]);

  outo[6][4] = atan2(-(ax*s1[2] - ay*c1[2]) / s5[6], (c23[2] * (ax*c1[2] + ay*s1[2]) - az*s23[2]) / s5[6]);
  s4[6] = sin(outo[6][4]);
  c4[6] = cos(outo[6][4]);

  outo[7][4] = atan2(-(ax*s1[1] - ay*c1[1]) / s5[7], (c23[3] * (ax*c1[1] + ay*s1[1]) - az*s23[3]) / s5[7]);
  s4[7] = sin(outo[7][4]);
  c4[7] = cos(outo[7][4]);

  outo[8][4] = atan2(-(ax*s1[2] - ay*c1[2]) / s5[8], (c23[4] * (ax*c1[2] + ay*s1[2]) - az*s23[4]) / s5[8]);
  s4[8] = sin(outo[8][4]);
  c4[8] = cos(outo[8][4]);

  //算o6
  //  outo[1][6] = atan2(s4[1]*c5[1]*(c1[1]*oy-s1[1]*ox)-c4[1]*(s1[1]*nx-c1[1]*ny),(s1[1]*nx-c1[1]*ny)*(s1[1]*nx-c1[1]*ny)+(s1[1]*ox-c1[1]*oy)*(s1[1]*ox-c1[1]*oy));
  outo[1][6] = atan2(s4[1] * c5[1] * (c1[1] * oy - s1[1] * ox) - c4[1] * (s1[1] * nx - c1[1] * ny), s4[1] * c5[1] * (c1[1] * ny - s1[1] * nx) + c4[1] * (s1[1] * ox - c1[1] * oy));


  outo[2][6] = atan2(s4[2] * c5[2] * (c1[2] * oy - s1[2] * ox) - c4[2] * (s1[2] * nx - c1[2] * ny), s4[2] * c5[2] * (c1[2] * ny - s1[2] * nx) + c4[2] * (s1[2] * ox - c1[2] * oy));

  outo[3][6] = atan2(s4[3] * c5[3] * (c1[1] * oy - s1[1] * ox) - c4[3] * (s1[1] * nx - c1[1] * ny), s4[3] * c5[3] * (c1[1] * ny - s1[1] * nx) + c4[3] * (s1[1] * ox - c1[1] * oy));

  outo[4][6] = atan2(s4[4] * c5[4] * (c1[2] * oy - s1[2] * ox) - c4[4] * (s1[2] * nx - c1[2] * ny), s4[4] * c5[4] * (c1[2] * ny - s1[2] * nx) + c4[4] * (s1[2] * ox - c1[2] * oy));

  outo[5][6] = atan2(s4[5] * c5[5] * (c1[1] * oy - s1[1] * ox) - c4[5] * (s1[1] * nx - c1[1] * ny), s4[5] * c5[5] * (c1[1] * ny - s1[1] * nx) + c4[5] * (s1[1] * ox - c1[1] * oy));

  outo[6][6] = atan2(s4[6] * c5[6] * (c1[2] * oy - s1[2] * ox) - c4[6] * (s1[2] * nx - c1[2] * ny), s4[6] * c5[6] * (c1[2] * ny - s1[2] * nx) + c4[6] * (s1[2] * ox - c1[2] * oy));

  outo[7][6] = atan2(s4[7] * c5[7] * (c1[1] * oy - s1[1] * ox) - c4[7] * (s1[1] * nx - c1[1] * ny), s4[7] * c5[7] * (c1[1] * ny - s1[1] * nx) + c4[7] * (s1[1] * ox - c1[1] * oy));

  outo[8][6] = atan2(s4[8] * c5[8] * (c1[2] * oy - s1[2] * ox) - c4[8] * (s1[2] * nx - c1[2] * ny), s4[8] * c5[8] * (c1[2] * ny - s1[2] * nx) + c4[8] * (s1[2] * ox - c1[2] * oy));
}

void LinePos()
{
  // TODO: Add your control notification handler code here
  double zo, yo, czo, szo, cyo, syo;

  zo = atan2(py, px);
  szo = sin(zo);
  czo = cos(zo);

  yo = atan2(sqrt(px*px + py*py), pz);
  syo = sin(yo);
  cyo = cos(yo);


  nx = cyo*czo;
  ny = szo*cyo;
  nz = -syo;
  ox = -szo;
  oy = czo;
  oz = 0;
  ax = syo*czo;
  ay = szo*syo;
  az = cyo;

  m_nx = nx;
  m_ny = ny;
  m_nz = nz;

  m_ox = ox;
  m_oy = oy;
  m_oz = oz;

  m_ax = ax;
  m_ay = ay;
  m_az = az;

}
//限制范围的函数
int DetAngScal(double aa, double bb, double cc, double dd, double ee)
{
  int i = 0;

  if (aa<-90 || aa>90)
  {
    i = 1;
  }

  if (bb<-180 || bb>0)
  {
    i = 1;
  }

  if (cc<-10 || cc>180)
  {
    i = 1;
  }

  if (dd<-180 || dd>180)
  {
    i = 1;
  }
  /*
  if (ee<-135 || ee>0)
  {
    i = 1;
  }
  */
  if (i)
  {
    return 0;
  }

  return 1;
}

int calcAngle(void)//计算舵机角度()
{
  // TODO: Add your control notification handler code here
	nx = m_nx;
	ny = m_ny;
	nz = m_nz;

	ox = m_ox;
	oy = m_oy;
	oz = m_oz;

	ax = m_ax;
	ay = m_ay;
	az = m_az;

	r=px*px + py*py + pz*pz;
	
	
	if (r<rmin || r>rmax)
	{
		return 0;
	}
	else
	{
		LinePos();//线性化
		RunNijie();

		m_OutO11 = outo[1][1] * 180 / PI;
		m_OutO12 = outo[1][2] * 180 / PI;
		m_OutO13 = outo[1][3] * 180 / PI;
		m_OutO14 = outo[1][4] * 180 / PI;
		m_OutO15 = outo[1][5] * 180 / PI;
		m_OutO16 = outo[1][6] * 180 / PI;
		
		if (!DetAngScal(m_OutO11, m_OutO12, m_OutO13, m_OutO14, m_OutO15))
		{
			return 0;//此位置无解
		}
		else
		{
			return 1;//此位置有解
		}
		
		//return 1;
		
	}
}

/******************************************************************************/
  /*********************************手动控制模式************************************/
void ManualControl(void)
{
         if(normalPause)
         {
         
           return;//检测到暂停控制命令，直接返回以保持状态
         }
         if(gotHand==1)
         {
          /*if(speed<10)
          {
              armStatus=1;//更新手臂状态
              ready=0;
              length=0;
              //free(data);//释放内存
              USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);//打开接收中断
              return;
          
          }//当手的速度过小，认为是静止的*/
          /*px=(double) -(z);
          py=(double) -x;
          pz=(double) y;*/
          //if(calcAngle()==1)//calcAngle返回1说明有解
        //  {
            theta1=x;
            if(theta1>90) theta1=90;
            if(theta1<-90) theta1=90;
            theta2=y;
            if(theta2>90) theta2=90;
            if(theta2<-90) theta2=90;
            theta3=z;
            if(theta3>90) theta3=90;
            if(theta3<-90) theta3=90;
            runServoTo(servo_ptr,roll);//手腕翻滚
            runServoTo(servo_ptr+1,pitch);//手腕俯仰
            runServoTo(servo_ptr+2, theta1);//底座舵机  
             if(pinch<60)
            {
             runServoTo(servo_ptr+3,-10);//合爪子
            }
            else runServoTo(servo_ptr+3,60);//张爪子
            runServoTo(servo_ptr+4,theta2);//大臂舵机
            runServoTo(servo_ptr+5,theta3);//小臂舵机 
         // }
        
        
         }
         
        
       
         
 }


void armInit(){
    USART_ITConfig(USART1,USART_IT_RXNE,DISABLE);//暂时关闭接收中断
  
       for(int x=0;x<6;x++)
       {
         int target=(*servo_ptr).lastPos;
         runServoTo(servo_ptr,target);
         servo_ptr++;
       }
    USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);//打开接收中断

